
[
  {
    "topicValue": "CountriesOfTheWorld",
    "name": { "en": "Countries of the World", "es": "Países del Mundo" },
    "icon": "Globe",
    "detailedPromptInstructions": "Generate diverse trivia questions about countries from all continents. Questions should cover a wide range of topics including: capitals, major cities, famous geographical landmarks (mountains, rivers, deserts, lakes), historical events and periods, influential historical and contemporary figures (leaders, artists, scientists, athletes), cultural aspects (traditions, music, art, literature, festivals), national symbols (flags, emblems - describe them if visual), official languages, currencies, and significant contributions or characteristics of various nations. Aim for a global balance, not focusing excessively on one region. Avoid questions that are too obscure unless specifically targeting 'hard' difficulty. Ensure questions are verifiable and broadly interesting.",
    "difficultySpecificGuidelines": {
      "easy": "Focus on widely known facts about major or populous countries. Examples: 'What is the capital of France?', 'Which country is known for the pyramids of Giza?', 'What is the most spoken language in the world?'",
      "medium": "Cover important facts about a broader range of countries, including lesser-known capitals, significant cultural contributions, or important historical events. Examples: 'The Andes mountain range runs along the western edge of which continent?', 'What currency is used in Japan?', 'Name the longest river in Africa.'",
      "hard": "Delve into specific historical details, lesser-known geographical features, unique cultural traditions of smaller nations, or comparative questions about different countries. Examples: 'Which European country is a constitutional monarchy ruled by a Grand Duke?', 'What is the significance of the Treaty of Tordesillas in shaping global territories?', 'Compare the primary exports of Brazil and Australia.'"
    },
    "isPredefined": true
  }
]
