
[
  {
    "topicValue": "Mathematics",
    "name": { "en": "Mathematics", "es": "Matemáticas" },
    "icon": "Sigma",
    "detailedPromptInstructions": "Generate questions covering various branches of mathematics including arithmetic, algebra, geometry, trigonometry, calculus, and statistics. Questions should test knowledge of fundamental concepts, theorems, important figures, and problem-solving. Examples: 'What is the Pythagorean theorem?' or 'Who is considered the father of calculus?'",
    "difficultySpecificGuidelines": {
      "easy": "Basic arithmetic operations, simple geometric shapes, or very common mathematical terms. Example: 'What is 2 + 2?' or 'How many sides does a triangle have?'",
      "medium": "High school level algebra, geometry concepts, basic probability. Example: 'Solve for x: 2x + 5 = 11' or 'What is the area of a circle with radius r?'",
      "hard": "University-level concepts in calculus, linear algebra, abstract algebra, number theory, or advanced statistics. Example: 'What is a Taylor series expansion?' or 'Define a Group in abstract algebra.'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "Physics",
    "name": { "en": "Physics", "es": "Física" },
    "icon": "Atom",
    "detailedPromptInstructions": "Generate questions on classical mechanics, thermodynamics, electromagnetism, optics, relativity, quantum mechanics, and nuclear physics. Include laws, principles, historical figures, and units of measurement. Examples: 'What are Newton's three laws of motion?' or 'What is the speed of light in a vacuum?'",
    "difficultySpecificGuidelines": {
      "easy": "Very basic concepts like gravity, light, or common states of matter. Example: 'What makes things fall to the ground?' or 'Is light a wave or a particle?' (accept simple answers).",
      "medium": "High school physics concepts, including basic formulas and laws. Example: 'What is Ohm's Law?' or 'Explain the difference between kinetic and potential energy.'",
      "hard": "University-level concepts such as quantum field theory, special/general relativity paradoxes, advanced thermodynamics, or specific experiments/theorists. Example: 'Explain the significance of Maxwell's equations.' or 'What is Hawking radiation?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "Chemistry",
    "name": { "en": "Chemistry", "es": "Química" },
    "icon": "FlaskConical",
    "detailedPromptInstructions": "Generate questions about the periodic table, chemical bonds, reactions, stoichiometry, acids and bases, organic chemistry, inorganic chemistry, and biochemistry. Include nomenclature, properties of elements/compounds, and important chemists. Examples: 'What is the chemical symbol for Gold?' or 'What is a covalent bond?'",
    "difficultySpecificGuidelines": {
      "easy": "Basic chemical elements, common compounds, or simple states of matter changes. Example: 'What is H2O?' or 'What gas do humans breathe out?'",
      "medium": "High school chemistry concepts, balancing simple equations, types of bonds, or basic organic functional groups. Example: 'What is the pH scale?' or 'Name a noble gas.'",
      "hard": "University-level topics like quantum chemistry, advanced organic reaction mechanisms, spectroscopy, or complex inorganic chemistry. Example: 'Describe the mechanism of an SN2 reaction.' or 'What are the principles of NMR spectroscopy?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "Biology",
    "name": { "en": "Biology", "es": "Biología" },
    "icon": "Dna",
    "detailedPromptInstructions": "Generate questions on cell biology, genetics, evolution, ecology, botany, zoology, human anatomy, and physiology. Include key biological processes, classifications, and significant biologists. Examples: 'What is photosynthesis?' or 'Who proposed the theory of evolution by natural selection?'",
    "difficultySpecificGuidelines": {
      "easy": "Basic life processes, common animal/plant types, or major human body parts. Example: 'What do plants need to grow?' or 'Are humans mammals?'",
      "medium": "High school biology concepts like Mendelian genetics, cell structures, or ecological relationships. Example: 'What are mitochondria?' or 'Explain natural selection in simple terms.'",
      "hard": "University-level topics like molecular genetics, complex physiological systems, advanced evolutionary theory, or detailed ecological modeling. Example: 'Describe the process of protein synthesis, including transcription and translation.' or 'What is the role of CRISPR-Cas9 in gene editing?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "ComputerScience",
    "name": { "en": "Computer Science", "es": "Informática" },
    "icon": "Laptop",
    "detailedPromptInstructions": "Generate questions about algorithms, data structures, programming languages (concepts, not specific syntax unless very famous), operating systems, computer networks, databases, software engineering, and artificial intelligence. Examples: 'What does CPU stand for?' or 'Who is considered a pioneer of artificial intelligence?'",
    "difficultySpecificGuidelines": {
      "easy": "Very basic computer terms or functions. Example: 'What is a mouse used for with a computer?' or 'What is the internet?'",
      "medium": "Common programming concepts, types of software, or basic hardware components. Example: 'What is an algorithm?' or 'What is the difference between RAM and ROM?'",
      "hard": "University-level topics like computational complexity theory, advanced algorithms, distributed systems, or specific AI paradigms. Example: 'Explain the P vs NP problem.' or 'Describe the CAP theorem in distributed database systems.'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "WorldLiterature",
    "name": { "en": "World Literature", "es": "Literatura Mundial" },
    "icon": "BookOpenText",
    "detailedPromptInstructions": "Generate questions about major authors, classic and influential literary works, literary movements (e.g., Romanticism, Modernism), genres, and key literary terms from around the world. Examples: 'Who wrote \"One Hundred Years of Solitude\"?' or 'What is an epic poem?'",
    "difficultySpecificGuidelines": {
      "easy": "Very famous authors or titles of globally recognized books. Example: 'Who wrote the Harry Potter series?' or 'Is Hamlet a play or a novel?'",
      "medium": "Characters from well-known novels, major literary periods, or authors of significant classics. Example: 'Who is the protagonist of \"Pride and Prejudice\"?' or 'What literary movement is associated with authors like Virginia Woolf and James Joyce?'",
      "hard": "University-level analysis of literary themes, specific literary theories, obscure but critically acclaimed authors, or detailed knowledge of literary history. Example: 'Discuss the concept of the 'unreliable narrator' in postmodern literature.' or 'What are the key tenets of Russian Formalism?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "Philosophy",
    "name": { "en": "Philosophy", "es": "Filosofía" },
    "icon": "BrainCircuit",
    "detailedPromptInstructions": "Generate questions about major philosophers (e.g., Plato, Aristotle, Kant, Descartes), branches of philosophy (ethics, metaphysics, epistemology, logic), key philosophical concepts, and schools of thought. Examples: 'What is Plato's Allegory of the Cave about?' or 'What is existentialism?'",
    "difficultySpecificGuidelines": {
      "easy": "Very famous philosophers or basic philosophical questions. Example: 'Who said \"I think, therefore I am\"?' or 'What is a common ethical dilemma?'",
      "medium": "Key concepts from major philosophers or branches of philosophy. Example: 'What is utilitarianism?' or 'Briefly explain Cartesian dualism.'",
      "hard": "University-level philosophical arguments, detailed critiques of philosophical theories, or concepts from less mainstream philosophers. Example: 'Explain Kant's categorical imperative and one common criticism of it.' or 'What is the Gettier problem in epistemology?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "Economics",
    "name": { "en": "Economics", "es": "Economía" },
    "icon": "LineChart",
    "detailedPromptInstructions": "Generate questions about microeconomics, macroeconomics, fundamental economic principles (supply and demand, scarcity), market structures, economic indicators (GDP, inflation), and famous economists. Examples: 'What is the law of supply and demand?' or 'Who wrote \"The Wealth of Nations\"?'",
    "difficultySpecificGuidelines": {
      "easy": "Basic economic terms like 'money', 'price', or 'trade'. Example: 'What is a budget?' or 'Why do people work?'",
      "medium": "Core economic concepts like inflation, unemployment, or types of markets. Example: 'What is GDP?' or 'Explain the difference between a monopoly and perfect competition.'",
      "hard": "University-level economic theories, econometric models, or international economic policies. Example: 'Explain the IS-LM model.' or 'What is comparative advantage and how does it relate to international trade?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "Psychology",
    "name": { "en": "Psychology", "es": "Psicología" },
    "icon": "Brain",
    "detailedPromptInstructions": "Generate questions about major psychological theories, schools of thought (e.g., behaviorism, psychoanalysis, cognitive psychology), famous psychologists, common psychological disorders, and fundamental concepts in social, developmental, and cognitive psychology. Examples: 'Who is known for his work on classical conditioning with dogs?' or 'What is cognitive dissonance?'",
    "difficultySpecificGuidelines": {
      "easy": "Basic emotions, common human behaviors, or very famous psychologists. Example: 'What is an emotion?' or 'Who is Sigmund Freud?'",
      "medium": "Key psychological concepts, stages of development, or common research methods. Example: 'What is the difference between classical and operant conditioning?' or 'Describe one of Maslow's hierarchy of needs.'",
      "hard": "University-level topics like advanced neuropsychology, specific therapeutic techniques, complex statistical methods in psychological research, or critiques of major theories. Example: 'Explain the diathesis-stress model of psychological disorders.' or 'What are the main criticisms of Kohlberg's stages of moral development?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "PoliticalScience",
    "name": { "en": "Political Science", "es": "Ciencia Política" },
    "icon": "Landmark",
    "detailedPromptInstructions": "Generate questions about types of government, political ideologies, international relations, electoral systems, important political figures, and fundamental concepts of political theory. Examples: 'What is a democracy?' or 'Who wrote \"The Prince\"?'",
    "difficultySpecificGuidelines": {
      "easy": "Basic forms of government or very well-known political concepts/figures. Example: 'What is a president?' or 'What is the main purpose of laws?'",
      "medium": "Key political ideologies, branches of government, or significant international organizations. Example: 'What is the difference between a parliamentary and presidential system?' or 'What is the United Nations?'",
      "hard": "University-level political theory, comparative politics, international relations theories, or detailed analysis of political systems. Example: 'Explain John Rawls' concept of the 'veil of ignorance'.' or 'Discuss the core tenets of realism in international relations theory.'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "Sociology",
    "name": { "en": "Sociology", "es": "Sociología" },
    "icon": "Users2",
    "detailedPromptInstructions": "Generate questions about sociological theories (e.g., functionalism, conflict theory), social structures, culture, socialization, social stratification, deviance, and major sociological thinkers. Examples: 'What is social stratification?' or 'Who is considered one of the founding fathers of sociology, known for his work on suicide?'",
    "difficultySpecificGuidelines": {
      "easy": "Basic social concepts like 'family', 'community', or 'rules'. Example: 'What is a group of people living together called?'",
      "medium": "Key sociological terms, concepts of social inequality, or major social institutions. Example: 'What is culture?' or 'Explain the concept of social mobility.'",
      "hard": "University-level sociological theories, research methodologies, or in-depth analysis of social phenomena. Example: 'Compare and contrast Marx's and Weber's views on social class.' or 'What is anomie, according to Durkheim?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "Astronomy",
    "name": { "en": "Astronomy", "es": "Astronomía" },
    "icon": "Orbit",
    "detailedPromptInstructions": "Generate questions about planets, stars, galaxies, black holes, nebulae, comets, asteroids, telescopes, space missions, and cosmological theories. Examples: 'Which planet is known as the Red Planet?' or 'What is a supernova?'",
    "difficultySpecificGuidelines": {
      "easy": "Names of planets, moon, sun, or very basic space concepts. Example: 'What is the name of Earth's moon?' or 'Is the Sun a star or a planet?'",
      "medium": "Basic characteristics of celestial bodies, types of galaxies, or famous astronomers. Example: 'What is the Kuiper Belt?' or 'Who developed the laws of planetary motion?'",
      "hard": "University-level astrophysics, detailed stellar evolution, cosmological models, or specifics of astronomical observation techniques. Example: 'Explain the Hertzsprung-Russell diagram.' or 'What is dark matter and what is the evidence for it?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "Geology",
    "name": { "en": "Geology", "es": "Geología" },
    "icon": "MountainSnow",
    "detailedPromptInstructions": "Generate questions about rock types (igneous, sedimentary, metamorphic), plate tectonics, volcanoes, earthquakes, minerals, fossils, geological time scale, and Earth's structure. Examples: 'What are the three main types of rocks?' or 'What is the theory of plate tectonics?'",
    "difficultySpecificGuidelines": {
      "easy": "Common geological features like mountains or rivers, or basic rock types. Example: 'What is a volcano?' or 'Is sand a rock?'",
      "medium": "The rock cycle, types of plate boundaries, or major geological eras. Example: 'What is the Mohs scale of hardness used for?' or 'Describe how mountains are formed.'",
      "hard": "University-level mineralogy, petrology, structural geology, or detailed geochronology. Example: 'Explain Bowen's reaction series.' or 'What are the different types of seismic waves and how are they used to study Earth's interior?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "Linguistics",
    "name": { "en": "Linguistics", "es": "Lingüística" },
    "icon": "Languages",
    "detailedPromptInstructions": "Generate questions about phonetics, phonology, morphology, syntax, semantics, pragmatics, historical linguistics, language families, and famous linguists. Examples: 'What is a phoneme?' or 'Who is known for the theory of Universal Grammar?'",
    "difficultySpecificGuidelines": {
      "easy": "Basic concepts like 'word', 'sentence', or different languages. Example: 'What is a verb?' or 'How many letters are in the English alphabet?'",
      "medium": "Core branches of linguistics, parts of speech, or basic language change concepts. Example: 'What is the difference between syntax and semantics?' or 'What is a morpheme?'",
      "hard": "University-level linguistic theories, detailed phonological rules, comparative linguistics, or sociolinguistic phenomena. Example: 'Explain Chomsky's concept of 'generative grammar'.' or 'What is Grimm's Law in historical linguistics?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "MusicTheory",
    "name": { "en": "Music Theory", "es": "Teoría Musical" },
    "icon": "Music3",
    "detailedPromptInstructions": "Generate questions about musical notation, scales, chords, harmony, melody, rhythm, time signatures, key signatures, musical forms, and basic analysis. Examples: 'What are the notes in a C major scale?' or 'What does a sharp symbol (#) do to a note?'",
    "difficultySpecificGuidelines": {
      "easy": "Basic musical symbols like notes or rests, or common instrument families. Example: 'What is a staff in music?' or 'Is a piano a string or percussion instrument?' (can be both, focus on primary).",
      "medium": "Major and minor scales, basic chord types, or common time signatures. Example: 'How many beats are in a measure of 4/4 time?' or 'What is a triad?'",
      "hard": "University-level harmony, counterpoint, musical form analysis, or advanced notation concepts. Example: 'Explain the function of a Neapolitan chord.' or 'What is a fugue?'"
    },
    "isPredefined": true
  }
]
    