
[
  {
    "topicValue": "Science",
    "name": { "en": "Science", "es": "Ciencia" },
    "icon": "FlaskConical",
    "detailedPromptInstructions": {
      "en": "Generate questions covering various branches of science including physics, chemistry, biology, astronomy, and earth sciences. Questions should test knowledge of fundamental concepts, historical discoveries, important figures, and recent advancements. Examples: 'What is the process by which plants convert light energy into chemical energy?' or 'Who developed the theory of general relativity?'",
      "es": "Genera preguntas que cubran diversas ramas de la ciencia, incluyendo física, química, biología, astronomía y ciencias de la Tierra. Las preguntas deben evaluar el conocimiento de conceptos fundamentales, descubrimientos históricos, figuras importantes y avances recientes. Ejemplos: '¿Cuál es el proceso mediante el cual las plantas convierten la energía lumínica en energía química?' o '¿Quién desarrolló la teoría de la relatividad general?'"
    },
    "difficultySpecificGuidelines": {
      "very easy": { "en": "Focus on common, everyday science facts, observable phenomena, or very basic definitions usually learned in early primary school. Example: 'What color is the sky on a sunny day?' or 'How many legs does a spider have?'", "es": "Céntrate en hechos científicos comunes y cotidianos, fenómenos observables o definiciones muy básicas que se suelen aprender en los primeros años de primaria. Ejemplo: '¿De qué color es el cielo en un día soleado?' o '¿Cuántas patas tiene una araña?'" },
      "easy": { "en": "Target general science knowledge typically covered in late primary or early secondary school. Example: 'What is the chemical symbol for water?' or 'What force pulls objects towards the Earth?'", "es": "Dirígete a conocimientos científicos generales que se suelen cubrir al final de la primaria o principios de la secundaria. Ejemplo: '¿Cuál es el símbolo químico del agua?' o '¿Qué fuerza atrae los objetos hacia la Tierra?'" },
      "medium": { "en": "Cover concepts from standard secondary school science curricula. Example: 'What is photosynthesis?' or 'Name the planets in our solar system in order from the Sun.'", "es": "Cubre conceptos de los currículos de ciencias estándar de la escuela secundaria. Ejemplo: '¿Qué es la fotosíntesis?' o 'Nombra los planetas de nuestro sistema solar en orden desde el Sol.'" },
      "hard": { "en": "Focus on specific theories, complex biological processes, advanced physics concepts not typically covered in high school, or detailed chemical reactions. Example: 'Explain the significance of the Hubble constant in cosmology.'", "es": "Céntrate en teorías específicas, procesos biológicos complejos, conceptos de física avanzada que normalmente no se cubren en la escuela secundaria, o reacciones químicas detalladas. Ejemplo: 'Explica la importancia de la constante de Hubble en cosmología.'" },
      "very hard": { "en": "Delve into niche subfields, cutting-edge research topics, complex mathematical formulations in physics, or intricate biochemical pathways. Questions might require understanding of multiple advanced concepts. Example: 'Describe the mechanism and implications of CRISPR-Cas9 gene editing technology.'", "es": "Profundiza en subcampos de nicho, temas de investigación de vanguardia, formulaciones matemáticas complejas en física o rutas bioquímicas intrincadas. Las preguntas pueden requerir la comprensión de múltiples conceptos avanzados. Ejemplo: 'Describe el mecanismo y las implicaciones de la tecnología de edición genética CRISPR-Cas9.'" }
    }
  },
  {
    "topicValue": "History",
    "name": { "en": "History", "es": "Historia" },
    "icon": "ScrollText",
    "detailedPromptInstructions": {
      "en": "Generate questions about significant historical events, periods, figures, and civilizations from around the world. Include ancient, medieval, and modern history. Examples: 'Who was the first Roman Emperor?' or 'What event is considered the start of World War II?'",
      "es": "Genera preguntas sobre eventos históricos significativos, períodos, figuras y civilizaciones de todo el mundo. Incluye historia antigua, medieval y moderna. Ejemplos: '¿Quién fue el primer emperador romano?' o '¿Qué evento se considera el inicio de la Segunda Guerra Mundial?'"
    },
    "difficultySpecificGuidelines": {
      "very easy": { "en": "Questions about widely known historical figures or events, often taught in primary school. Example: 'Who discovered America in 1492 (from European perspective)?' or 'In which country are the pyramids of Giza?'", "es": "Preguntas sobre figuras o eventos históricos muy conocidos, a menudo enseñados en primaria. Ejemplo: '¿Quién descubrió América en 1492 (desde la perspectiva europea)?' o '¿En qué país están las pirámides de Giza?'" },
      "easy": { "en": "Focus on major historical events or figures generally known by those with basic secondary education. Example: 'What was the Renaissance?' or 'Who was Martin Luther King Jr.?'", "es": "Céntrate en eventos o figuras históricas importantes generalmente conocidas por aquellos con educación secundaria básica. Ejemplo: '¿Qué fue el Renacimiento?' o '¿Quién fue Martin Luther King Jr.?'" },
      "medium": { "en": "Cover specific details of major historical periods, causes/effects of significant events, or notable but not universally known figures. Example: 'What were the main causes of the French Revolution?' or 'Who was Genghis Khan?'", "es": "Cubre detalles específicos de períodos históricos importantes, causas/efectos de eventos significativos, o figuras notables pero no universalmente conocidas. Ejemplo: '¿Cuáles fueron las principales causas de la Revolución Francesa?' o '¿Quién fue Gengis Kan?'" },
      "hard": { "en": "Questions requiring deeper knowledge of specific historical contexts, lesser-known events or figures, or analysis of historical trends. Example: 'Discuss the socio-economic impact of the Black Death in 14th century Europe.'", "es": "Preguntas que requieren un conocimiento más profundo de contextos históricos específicos, eventos o figuras menos conocidos, o análisis de tendencias históricas. Ejemplo: 'Discute el impacto socioeconómico de la Peste Negra en la Europa del siglo XIV.'" },
      "very hard": { "en": "Delve into historiographical debates, nuanced interpretations of historical events, or very specific details of obscure historical periods or figures. Example: 'Analyze the primary motivations behind the Peloponnesian War according to Thucydides versus modern interpretations.'", "es": "Profundiza en debates historiográficos, interpretaciones matizadas de eventos históricos, o detalles muy específicos de períodos o figuras históricas oscuras. Ejemplo: 'Analiza las motivaciones principales detrás de la Guerra del Peloponeso según Tucídides versus interpretaciones modernas.'" }
    }
  },
  {
    "topicValue": "Sports",
    "name": { "en": "Sports", "es": "Deportes" },
    "icon": "Goal",
    "detailedPromptInstructions": {
      "en": "Generate questions about various sports including rules, famous athletes, major tournaments, and historical moments in sports like soccer, basketball, tennis, olympics, etc. Examples: 'Which country won the FIFA World Cup in 2022?' or 'How many points is a touchdown worth in American football?'",
      "es": "Genera preguntas sobre diversos deportes, incluyendo reglas, atletas famosos, torneos importantes y momentos históricos en deportes como fútbol, baloncesto, tenis, olimpiadas, etc. Ejemplos: '¿Qué país ganó la Copa Mundial de la FIFA en 2022?' o '¿Cuántos puntos vale un touchdown en el fútbol americano?'"
    },
    "difficultySpecificGuidelines": {
      "very easy": { "en": "Extremely common sports knowledge. Example: 'What sport is played with a black and white ball and goals?' or 'How many players are on a basketball team on the court?'", "es": "Conocimientos deportivos extremadamente comunes. Ejemplo: '¿Qué deporte se juega con una pelota blanca y negra y porterías?' o '¿Cuántos jugadores hay en un equipo de baloncesto en la cancha?'" },
      "easy": { "en": "Well-known athletes, popular sports rules, or major international competitions. Example: 'Who is considered one of the greatest basketball players of all time, known for playing for the Chicago Bulls?' or 'How often are the Summer Olympics held?'", "es": "Atletas muy conocidos, reglas de deportes populares o competiciones internacionales importantes. Ejemplo: '¿Quién es considerado uno de los mejores jugadores de baloncesto de todos los tiempos, conocido por jugar en los Chicago Bulls?' o '¿Cada cuánto tiempo se celebran los Juegos Olímpicos de Verano?'" },
      "medium": { "en": "Specific records, details about less globally popular sports, or notable achievements by athletes. Example: 'Which tennis player holds the record for the most Grand Slam singles titles (male or female)?' or 'What is a hat-trick in soccer?'", "es": "Récords específicos, detalles sobre deportes menos populares a nivel mundial, o logros notables de atletas. Ejemplo: '¿Qué tenista tiene el récord de más títulos individuales de Grand Slam (masculino o femenino)?' o '¿Qué es un hat-trick en el fútbol?'" },
      "hard": { "en": "Questions about historical sports figures, specific rules nuances, or details from past major tournaments. Example: 'In what year did Roger Bannister break the four-minute mile barrier?' or 'Explain the offside rule in soccer.'", "es": "Preguntas sobre figuras deportivas históricas, matices específicos de reglas, o detalles de torneos importantes pasados. Ejemplo: '¿En qué año Roger Bannister rompió la barrera de los cuatro minutos en la milla?' o 'Explica la regla del fuera de juego en el fútbol.'" },
      "very hard": { "en": "Focus on obscure sports, very specific historical details, or complex strategic elements of sports. Example: 'Who won the first ever FIFA World Cup in 1930?' or 'Describe the different types of pitches a baseball pitcher might throw and their typical effects.'", "es": "Céntrate en deportes poco conocidos, detalles históricos muy específicos, o elementos estratégicos complejos de los deportes. Ejemplo: '¿Quién ganó la primera Copa Mundial de la FIFA en 1930?' o 'Describe los diferentes tipos de lanzamientos que un lanzador de béisbol podría realizar y sus efectos típicos.'" }
    }
  },
  {
    "topicValue": "Movies",
    "name": { "en": "Movies", "es": "Películas" },
    "icon": "Film",
    "detailedPromptInstructions": {
      "en": "Generate questions about famous movies, directors, actors, awards (e.g., Oscars), genres, and memorable quotes or scenes. Cover a range from classic cinema to contemporary films. Examples: 'Which movie won the Best Picture Oscar in 2020?' or 'Who directed the movie Pulp Fiction?'",
      "es": "Genera preguntas sobre películas famosas, directores, actores, premios (ej. Oscars), géneros y citas o escenas memorables. Cubre un rango desde el cine clásico hasta películas contemporáneas. Ejemplos: '¿Qué película ganó el Oscar a la Mejor Película en 2020?' o '¿Quién dirigió la película Pulp Fiction?'"
    },
    "difficultySpecificGuidelines": {
      "very easy": { "en": "Questions about extremely famous movies or characters known by almost everyone. Example: 'What is the name of the young wizard in the Harry Potter series?' or 'In Star Wars, what color is Darth Vader's lightsaber?'", "es": "Preguntas sobre películas o personajes extremadamente famosos conocidos por casi todos. Ejemplo: '¿Cómo se llama el joven mago de la serie Harry Potter?' o 'En Star Wars, ¿de qué color es el sable de luz de Darth Vader?'" },
      "easy": { "en": "Focus on iconic movies, very famous actors/directors, or major awards. Example: 'Which movie features the line, \"Here's looking at you, kid\"?' or 'Who played Jack Dawson in the movie Titanic?'", "es": "Céntrate en películas icónicas, actores/directores muy famosos o premios importantes. Ejemplo: '¿En qué película aparece la frase \"Siempre nos quedará París\"?' (adaptado) o '¿Quién interpretó a Jack Dawson en la película Titanic?'" },
      "medium": { "en": "Cover well-known films from various genres, significant awards for specific roles/films, or identifying directors of popular movies. Example: 'Which film won the Palme d'Or at the Cannes Film Festival in 1994?' or 'Name three movies directed by Steven Spielberg.'", "es": "Cubre películas conocidas de diversos géneros, premios significativos por papeles/películas específicas, o identificar directores de películas populares. Ejemplo: '¿Qué película ganó la Palma de Oro en el Festival de Cannes en 1994?' o 'Nombra tres películas dirigidas por Steven Spielberg.'" },
      "hard": { "en": "Questions about influential classic films, specific cinematic techniques used in a film, or identifying supporting actors or crew members from famous movies. Example: 'What is a MacGuffin in filmmaking, a term popularized by Alfred Hitchcock?' or 'Who composed the score for the movie \"The Good, the Bad and the Ugly\"?'", "es": "Preguntas sobre películas clásicas influyentes, técnicas cinematográficas específicas utilizadas en una película, o identificar actores de reparto o miembros del equipo de películas famosas. Ejemplo: '¿Qué es un MacGuffin en el cine, término popularizado por Alfred Hitchcock?' o '¿Quién compuso la banda sonora de la película \"El Bueno, el Malo y el Feo\"?'" },
      "very hard": { "en": "Delve into arthouse cinema, obscure cult films, specific details about film movements, or technical aspects of filmmaking in relation to specific movies. Example: 'Explain the Kuleshov Effect and name a director who extensively used it.' or 'Who was the cinematographer for the movie \"Citizen Kane\"?'", "es": "Profundiza en el cine de autor, películas de culto poco conocidas, detalles específicos sobre movimientos cinematográficos, o aspectos técnicos de la cinematografía en relación con películas específicas. Ejemplo: 'Explica el Efecto Kuleshov y nombra a un director que lo utilizó ampliamente.' o '¿Quién fue el director de fotografía de la película \"Ciudadano Kane\"?'" }
    }
  },
  {
    "topicValue": "Geography",
    "name": { "en": "Geography", "es": "Geografía" },
    "icon": "Map",
    "detailedPromptInstructions": {
      "en": "Generate questions about countries, capitals, flags, famous landmarks, continents, oceans, mountains, rivers, and general geographical concepts. Examples: 'What is the capital of Japan?' or 'Which is the longest river in the world?'",
      "es": "Genera preguntas sobre países, capitales, banderas, lugares emblemáticos famosos, continentes, océanos, montañas, ríos y conceptos geográficos generales. Ejemplos: '¿Cuál es la capital de Japón?' o '¿Cuál es el río más largo del mundo?'"
    },
    "difficultySpecificGuidelines": {
      "very easy": { "en": "Basic geographical facts, like naming continents or very famous countries/landmarks. Example: 'How many continents are there?' or 'Paris is the capital of which country?'", "es": "Hechos geográficos básicos, como nombrar continentes o países/lugares muy famosos. Ejemplo: '¿Cuántos continentes hay?' o '¿París es la capital de qué país?'" },
      "easy": { "en": "Capitals of well-known countries, major rivers or mountains, or identifying flags of prominent nations. Example: 'What is the largest desert in the world?' or 'Which ocean is between Europe and North America?'", "es": "Capitales de países conocidos, ríos o montañas importantes, o identificar banderas de naciones prominentes. Ejemplo: '¿Cuál es el desierto más grande del mundo?' o '¿Qué océano se encuentra entre Europa y América del Norte?'" },
      "medium": { "en": "Questions about specific geographical features, climate zones, less common capitals, or locations of specific landmarks. Example: 'Mount Kilimanjaro is located in which African country?' or 'What is the Ring of Fire?'", "es": "Preguntas sobre características geográficas específicas, zonas climáticas, capitales menos comunes o ubicaciones de lugares específicos. Ejemplo: 'El Monte Kilimanjaro se encuentra en ¿qué país africano?' o '¿Qué es el Cinturón de Fuego?'" },
      "hard": { "en": "Detailed knowledge of topography, specific international borders, demographic geography, or smaller countries and their capitals. Example: 'What is the term for a body of land completely surrounded by water but smaller than a continent?' or 'Name the two countries that share the longest continuous international border.'", "es": "Conocimiento detallado de topografía, fronteras internacionales específicas, geografía demográfica o países más pequeños y sus capitales. Ejemplo: '¿Cuál es el término para una masa de tierra completamente rodeada de agua pero más pequeña que un continente?' o 'Nombra los dos países que comparten la frontera internacional continua más larga.'" },
      "very hard": { "en": "Focus on obscure geographical facts, complex geopolitical boundaries, specific details of remote regions, or understanding complex geographical phenomena. Example: 'Explain the orographic effect and provide an example of a region significantly impacted by it.' or 'What is the capital of Kiribati?'", "es": "Céntrate en hechos geográficos poco conocidos, límites geopolíticos complejos, detalles específicos de regiones remotas o la comprensión de fenómenos geográficos complejos. Ejemplo: 'Explica el efecto orográfico y proporciona un ejemplo de una región significativamente afectada por él.' o '¿Cuál es la capital de Kiribati?'" }
    }
  },
  {
    "topicValue": "Music",
    "name": { "en": "Music", "es": "Música" },
    "icon": "Music2",
    "detailedPromptInstructions": {
      "en": "Generate questions about various music genres, famous artists, bands, albums, songs, musical instruments, and music history. Cover classical, pop, rock, jazz, hip-hop, etc. Examples: 'Who is known as the \"King of Pop\"?' or 'What instrument did Jimi Hendrix famously play?'",
      "es": "Genera preguntas sobre diversos géneros musicales, artistas famosos, bandas, álbumes, canciones, instrumentos musicales e historia de la música. Cubre clásica, pop, rock, jazz, hip-hop, etc. Ejemplos: '¿Quién es conocido como el \"Rey del Pop\"?' o '¿Qué instrumento tocaba Jimi Hendrix?'"
    },
    "difficultySpecificGuidelines": {
      "very easy": { "en": "Questions about extremely famous artists or songs, or basic musical concepts. Example: 'Name a song by The Beatles.' or 'What do you use to listen to music (e.g., part of your body)?'", "es": "Preguntas sobre artistas o canciones extremadamente famosas, o conceptos musicales básicos. Ejemplo: 'Nombra una canción de The Beatles.' o '¿Qué usas para escuchar música (ej. parte de tu cuerpo)?'" },
      "easy": { "en": "Identify iconic artists, major music genres, or very popular songs/albums. Example: 'Which band released the album \"Dark Side of the Moon\"?' or 'What genre of music is typically associated with artists like Louis Armstrong and Duke Ellington?'", "es": "Identifica artistas icónicos, géneros musicales principales o canciones/álbumes muy populares. Ejemplo: '¿Qué banda lanzó el álbum \"Dark Side of the Moon\"?' o '¿Qué género musical se asocia típicamente con artistas como Louis Armstrong y Duke Ellington?'" },
      "medium": { "en": "Questions about specific song lyrics, band members (other than lead singer), or identifying instruments in a less common context. Example: 'Complete the lyric: \"Yesterday, all my troubles seemed so...\"' or 'Who was the drummer for the band Led Zeppelin?'", "es": "Preguntas sobre letras de canciones específicas, miembros de bandas (aparte del cantante principal), o identificar instrumentos en un contexto menos común. Ejemplo: 'Completa la letra: \"Yesterday, all my troubles seemed so...\"' o '¿Quién fue el baterista de la banda Led Zeppelin?'" },
      "hard": { "en": "Knowledge of music theory, influential albums from niche genres, or details about music history. Example: 'What is a common time signature for a waltz?' or 'Which artist is credited with pioneering the \"Wall of Sound\" production technique?'", "es": "Conocimiento de teoría musical, álbumes influyentes de géneros de nicho, o detalles sobre la historia de la música. Ejemplo: '¿Cuál es un compás común para un vals?' o '¿A qué artista se le atribuye ser pionero en la técnica de producción \"Muro de Sonido\"?'" },
      "very hard": { "en": "Focus on obscure artists, complex musical structures, specific details of music production, or deep cuts from influential artists. Example: 'Identify three characteristics of modal jazz.' or 'What year was the Moog synthesizer first commercially released?'", "es": "Céntrate en artistas poco conocidos, estructuras musicales complejas, detalles específicos de producción musical o canciones menos conocidas de artistas influyentes. Ejemplo: 'Identifica tres características del jazz modal.' o '¿En qué año se lanzó comercialmente por primera vez el sintetizador Moog?'" }
    }
  }
]

    