
[
  {
    "topicValue": "Science",
    "name": { "en": "Science", "es": "Ciencia" },
    "icon": "FlaskConical",
    "detailedPromptInstructions": "Generate questions covering various branches of science including physics, chemistry, biology, astronomy, and earth sciences. Questions should test knowledge of fundamental concepts, historical discoveries, important figures, and recent advancements. Examples: 'What is the process by which plants convert light energy into chemical energy?' or 'Who developed the theory of general relativity?'",
    "difficultySpecificGuidelines": {
      "easy": "Target general science knowledge typically covered in late primary or early secondary school. Example: 'What is the chemical symbol for water?' or 'What force pulls objects towards the Earth?'",
      "medium": "Cover concepts from standard secondary school science curricula. Example: 'What is photosynthesis?' or 'Name the planets in our solar system in order from the Sun.'",
      "hard": "Focus on specific theories, complex biological processes, advanced physics concepts not typically covered in high school, or detailed chemical reactions. Example: 'Explain the significance of the Hubble constant in cosmology.'"
    },
    "isPredefined": false
  },
  {
    "topicValue": "History",
    "name": { "en": "History", "es": "Historia" },
    "icon": "ScrollText",
    "detailedPromptInstructions": "Generate questions about significant historical events, periods, figures, and civilizations from around the world. Include ancient, medieval, and modern history. Examples: 'Who was the first Roman Emperor?' or 'What event is considered the start of World War II?'",
    "difficultySpecificGuidelines": {
      "easy": "Focus on major historical events or figures generally known by those with basic secondary education. Example: 'What was the Renaissance?' or 'Who was Martin Luther King Jr.?'",
      "medium": "Cover specific details of major historical periods, causes/effects of significant events, or notable but not universally known figures. Example: 'What were the main causes of the French Revolution?' or 'Who was Genghis Khan?'",
      "hard": "Questions requiring deeper knowledge of specific historical contexts, lesser-known events or figures, or analysis of historical trends. Example: 'Discuss the socio-economic impact of the Black Death in 14th century Europe.'"
    },
    "isPredefined": false
  },
  {
    "topicValue": "Sports",
    "name": { "en": "Sports", "es": "Deportes" },
    "icon": "Goal",
    "detailedPromptInstructions": "Generate questions about various sports including rules, famous athletes, major tournaments, and historical moments in sports like soccer, basketball, tennis, olympics, etc. Examples: 'Which country won the FIFA World Cup in 2022?' or 'How many points is a touchdown worth in American football?'",
    "difficultySpecificGuidelines": {
      "easy": "Well-known athletes, popular sports rules, or major international competitions. Example: 'Who is considered one of the greatest basketball players of all time, known for playing for the Chicago Bulls?' or 'How often are the Summer Olympics held?'",
      "medium": "Specific records, details about less globally popular sports, or notable achievements by athletes. Example: 'Which tennis player holds the record for the most Grand Slam singles titles (male or female)?' or 'What is a hat-trick in soccer?'",
      "hard": "Questions about historical sports figures, specific rules nuances, or details from past major tournaments. Example: 'In what year did Roger Bannister break the four-minute mile barrier?' or 'Explain the offside rule in soccer.'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "Movies",
    "name": { "en": "Movies", "es": "Películas" },
    "icon": "Film",
    "detailedPromptInstructions": "Generate questions about famous movies, directors, actors, awards (e.g., Oscars), genres, and memorable quotes or scenes. Cover a range from classic cinema to contemporary films. Examples: 'Which movie won the Best Picture Oscar in 2020?' or 'Who directed the movie Pulp Fiction?'",
    "difficultySpecificGuidelines": {
      "easy": "Focus on iconic movies, very famous actors/directors, or major awards. Example: 'Which movie features the line, \"Here's looking at you, kid\"?' or 'Who played Jack Dawson in the movie Titanic?'",
      "medium": "Cover well-known films from various genres, significant awards for specific roles/films, or identifying directors of popular movies. Example: 'Which film won the Palme d'Or at the Cannes Film Festival in 1994?' or 'Name three movies directed by Steven Spielberg.'",
      "hard": "Questions about influential classic films, specific cinematic techniques used in a film, or identifying supporting actors or crew members from famous movies. Example: 'What is a MacGuffin in filmmaking, a term popularized by Alfred Hitchcock?' or 'Who composed the score for the movie \"The Good, the Bad and the Ugly\"?'"
    },
    "isPredefined": false
  },
  {
    "topicValue": "Geography",
    "name": { "en": "Geography", "es": "Geografía" },
    "icon": "Map",
    "detailedPromptInstructions": "Generate questions about countries, capitals, flags, famous landmarks, continents, oceans, mountains, rivers, and general geographical concepts. Examples: 'What is the capital of Japan?' or 'Which is the longest river in the world?'",
    "difficultySpecificGuidelines": {
      "easy": "Capitals of well-known countries, major rivers or mountains, or identifying flags of prominent nations. Example: 'What is the largest desert in the world?' or 'Which ocean is between Europe and North America?'",
      "medium": "Questions about specific geographical features, climate zones, less common capitals, or locations of specific landmarks. Example: 'Mount Kilimanjaro is located in which African country?' or 'What is the Ring of Fire?'",
      "hard": "Detailed knowledge of topography, specific international borders, demographic geography, or smaller countries and their capitals. Example: 'What is the term for a body of land completely surrounded by water but smaller than a continent?' or 'Name the two countries that share the longest continuous international border.'"
    },
    "isPredefined": false
  },
  {
    "topicValue": "Music",
    "name": { "en": "Music", "es": "Música" },
    "icon": "Music2",
    "detailedPromptInstructions": "Generate questions about various music genres, famous artists, bands, albums, songs, musical instruments, and music history. Cover classical, pop, rock, jazz, hip-hop, etc. Examples: 'Who is known as the \"King of Pop\"?' or 'What instrument did Jimi Hendrix famously play?'",
    "difficultySpecificGuidelines": {
      "easy": "Identify iconic artists, major music genres, or very popular songs/albums. Example: 'Which band released the album \"Dark Side of the Moon\"?' or 'What genre of music is typically associated with artists like Louis Armstrong and Duke Ellington?'",
      "medium": "Questions about specific song lyrics, band members (other than lead singer), or identifying instruments in a less common context. Example: 'Complete the lyric: \"Yesterday, all my troubles seemed so...\"' or 'Who was the drummer for the band Led Zeppelin?'",
      "hard": "Knowledge of music theory, influential albums from niche genres, or details about music history. Example: 'What is a common time signature for a waltz?' or 'Which artist is credited with pioneering the \"Wall of Sound\" production technique?'"
    },
    "isPredefined": false
  },
  {
    "topicValue": "Art_Literature",
    "name": { "en": "Art & Literature", "es": "Arte y Literatura" },
    "icon": "Palette",
    "detailedPromptInstructions": "Generate questions about famous painters, sculptors, artistic movements (e.g., Impressionism, Surrealism), classic and contemporary authors, famous novels, poems, and literary periods. Examples: 'Who painted the Mona Lisa?' or 'Which novel begins with the line \"Call me Ishmael\"?'",
    "difficultySpecificGuidelines": {
      "easy": "Recognizing very famous artists/authors or their most iconic works. Example: 'Who wrote Romeo and Juliet?'",
      "medium": "Identifying specific art movements, literary genres, or characters from well-known books/plays. Example: 'What art movement is Salvador Dalí associated with?'",
      "hard": "Questions about literary theory, specific artistic techniques, or less mainstream authors/works. Example: 'What is meant by 'stream of consciousness' in literature?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "Food_Drink",
    "name": { "en": "Food & Drink", "es": "Comida y Bebida" },
    "icon": "CookingPot",
    "detailedPromptInstructions": "Generate questions about international cuisines, famous dishes, ingredients, cooking techniques, types of beverages (alcoholic and non-alcoholic), and culinary history. Examples: 'What is the main ingredient in guacamole?' or 'Which country is famous for originating sushi?'",
    "difficultySpecificGuidelines": {
      "easy": "Identifying common foods, famous national dishes, or basic ingredients. Example: 'What type of pasta is typically used in lasagna?'",
      "medium": "Questions about specific cooking methods, regional specialties, or origins of particular dishes. Example: 'What does 'al dente' mean in cooking?'",
      "hard": "Detailed knowledge of gastronomy, rare ingredients, oenology, or historical food origins. Example: 'What are the five 'mother sauces' of French cuisine?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "Mythology",
    "name": { "en": "Mythology", "es": "Mitología" },
    "icon": "Swords",
    "detailedPromptInstructions": "Generate questions about gods, goddesses, heroes, mythical creatures, and epic tales from various mythologies (e.g., Greek, Roman, Norse, Egyptian, Celtic). Examples: 'Who is the Greek god of the sea?' or 'What creature in Norse mythology is a giant wolf destined to kill Odin during Ragnarök?'",
    "difficultySpecificGuidelines": {
      "easy": "Identifying major gods/goddesses or very famous mythical figures/stories. Example: 'Zeus is the king of the gods in which mythology?'",
      "medium": "Questions about specific myths, relationships between mythological figures, or attributes of lesser-known deities. Example: 'Who was Persephone in Greek mythology?'",
      "hard": "Detailed knowledge of specific epic poems, comparative mythology, or obscure mythological figures. Example: 'What are the Twelve Labours of Heracles?'"
    },
    "isPredefined": false
  },
  {
    "topicValue": "Technology",
    "name": { "en": "Technology", "es": "Tecnología" },
    "icon": "Cpu",
    "detailedPromptInstructions": "Generate questions about the history of technology, famous inventors, breakthroughs in computing, the internet, software, hardware, and emerging technologies. Examples: 'Who is considered one of the co-founders of Apple Inc.?' or 'What does CPU stand for?'",
    "difficultySpecificGuidelines": {
      "easy": "Basic tech terms, very famous inventors, or widely used technologies. Example: 'What company developed the Windows operating system?'",
      "medium": "Understanding specific technological concepts, historical milestones, or key figures in tech development. Example: 'What is Moore's Law?'",
      "hard": "Detailed knowledge of programming concepts, specific hardware architectures, or the history of niche technologies. Example: 'Explain the difference between TCP and UDP protocols.'"
    },
    "isPredefined": false
  },
  {
    "topicValue": "Animals",
    "name": { "en": "Animals", "es": "Animales" },
    "icon": "PawPrint",
    "detailedPromptInstructions": "Generate questions about different animal species, their habitats, behaviors, classifications (mammals, reptiles, insects, etc.), endangered species, and unique animal facts. Examples: 'What is the largest land animal?' or 'Which bird is known for its ability to mimic human speech?'",
    "difficultySpecificGuidelines": {
      "easy": "Identifying common animals, basic animal facts, or well-known animal characteristics. Example: 'What sound does a dog make?'",
      "medium": "Questions about specific animal classifications, habitats, or unique behaviors. Example: 'Are dolphins mammals or fish?'",
      "hard": "Detailed knowledge of zoology, specific scientific names, or complex animal behaviors/adaptations. Example: 'What is echolocation and which animals use it?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "General_Knowledge",
    "name": { "en": "General Knowledge", "es": "Conocimiento General" },
    "icon": "Brain",
    "detailedPromptInstructions": "Generate questions covering a wide array of topics not strictly fitting into other categories. This can include current events, miscellaneous facts, common sense questions, basic world knowledge, recognizing symbols or logos, or general awareness. Aim for questions that are interesting and test broad awareness. Examples: 'How many colors are there in a rainbow?' or 'What is the currency of the United Kingdom?'",
    "difficultySpecificGuidelines": {
      "easy": "Very common knowledge facts that most people would know. Example: 'How many days are in a week?'",
      "medium": "Facts that are generally known but may require a moment of thought. Example: 'What is the capital of Australia?'",
      "hard": "Less common facts or those requiring connections between different pieces of information. Example: 'What do the five Olympic rings represent?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "GeographyAndHistoryGeneral",
    "name": {
      "en": "Geography & History",
      "es": "Geografía e Historia"
    },
    "icon": "Library",
    "detailedPromptInstructions": "Generate diverse trivia questions that cover both Geography and History. For Geography, include questions about countries, capitals, continents, oceans, major rivers, mountain ranges, deserts, climate zones, famous landmarks, and physical geography. For History, include questions about significant world events, historical periods (ancient, medieval, modern), influential figures (leaders, inventors, artists, explorers), civilizations, empires, wars, revolutions, and social movements. Encourage questions that may link geographical features or locations to historical events (e.g., 'Which mountain range did Hannibal cross with elephants to invade Italy?' or 'The ancient city of Babylon was located near which modern-day river?'). Aim for a global perspective.",
    "difficultySpecificGuidelines": {
      "easy": "Focus on very well-known geographical facts (e.g., largest oceans, continents) and major historical figures or events (e.g., 'Who was the first U.S. President?', 'What is the longest river in the world?'). Questions should be answerable with common general knowledge.",
      "medium": "Cover specific details about countries or regions, important historical treaties or battles, and the significance of certain geographical features. Example: 'What is the Ring of Fire and where is it located?' or 'What were the main causes of World War I?'",
      "hard": "Delve into questions requiring deeper knowledge of historical causality, geopolitical changes, specific geographical processes, or the history of exploration and cartography. Example: 'Explain the historical significance of the Silk Road on cultural exchange between East and West.' or 'Describe the formation of the Himalayan mountain range.'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "EntertainmentGeneral",
    "name": {
      "en": "Entertainment",
      "es": "Entretenimiento"
    },
    "icon": "Clapperboard",
    "detailedPromptInstructions": "Generate diverse trivia questions about various forms of entertainment. This can include movies (genres, actors, directors, awards, famous quotes, classic and modern films), music (artists, bands, albums, songs, genres like pop, rock, jazz, classical, hip-hop, music history, instruments), video games (popular titles, characters, consoles, genres, history), television series (popular shows, actors, characters, streaming hits, classic TV), theater (famous plays, musicals, playwrights), and general pop culture events or figures related to entertainment. Aim for a broad appeal.",
    "difficultySpecificGuidelines": {
      "easy": "Focus on widely known movies, globally famous music artists, iconic video game characters, or TV shows that are household names. Example: 'Who played the character Harry Potter in the movies?' or 'What band sang \"Bohemian Rhapsody\"?'",
      "medium": "Cover award-winning films/shows, specific music album details, well-known video game mechanics, or directors of popular works. Example: 'Which movie won the Best Picture Oscar in 2023?' or 'Name the lead singer of the band Queen.'",
      "hard": "Delve into classic cinema, niche music genres, specific details from video game lore, influential playwrights, or critical analysis of entertainment media. Example: 'What is the Kuleshov Effect in filmmaking?' or 'Which composer is known for the film scores of Star Wars and Jurassic Park?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "ScienceAndTechnologyGeneral",
    "name": {
      "en": "Science & Technology",
      "es": "Ciencia y Tecnología"
    },
    "icon": "Atom",
    "detailedPromptInstructions": "Generate diverse trivia questions covering both Science and Technology. For Science, include questions on physics, chemistry, biology, astronomy, earth sciences, fundamental concepts, historical discoveries, and important figures. For Technology, include questions on the history of technology, famous inventors, breakthroughs in computing, the internet, software, hardware, engineering principles, and emerging technologies. Encourage questions that might bridge both fields, such as the scientific principles behind technological advancements or the technological tools used for scientific discovery. Aim for questions that are verifiable and broadly interesting.",
    "difficultySpecificGuidelines": {
      "easy": "Focus on widely known scientific facts (e.g., 'What gas do plants absorb from the atmosphere?') or very common technological terms/devices (e.g., 'What does 'www' stand for in a website address?'). Questions should be answerable with general public knowledge.",
      "medium": "Cover core scientific concepts from secondary education or key technological innovations and their inventors. Example: 'What is the difference between nuclear fission and fusion?' or 'Who is credited with inventing the telephone?'",
      "hard": "Delve into specific scientific theories, complex technological processes, details of significant inventions, or the impact of technology on scientific research. Example: 'Explain the basic principles of quantum computing.' or 'What role did Bell Labs play in the development of the transistor?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "NatureGeneral",
    "name": {
      "en": "Nature",
      "es": "Naturaleza"
    },
    "icon": "Leaf",
    "detailedPromptInstructions": "Generate diverse trivia questions about the natural world. This should include topics related to the animal kingdom (species, behaviors, habitats, classifications), the plant kingdom (types of plants, trees, flowers, photosynthesis, plant anatomy), human anatomy and physiology (organs, systems, basic functions, senses), basic concepts of medicine and health (common illnesses if widely known, nutrition, hygiene, not deep medical diagnostics), ecosystems (biomes, food chains, environmental concepts), and general biology that pertains to living organisms and their interactions. Differentiate from pure physics, chemistry or technology.",
    "difficultySpecificGuidelines": {
      "easy": "Focus on widely known animals, common plants, basic human body parts or functions, and simple environmental facts. Example: 'What is the largest mammal on Earth?' or 'What do bees primarily collect from flowers?'",
      "medium": "Cover specific animal/plant classifications, functions of human organs, basic ecological concepts, or common health knowledge. Example: 'What are the main parts of a flower?' or 'What is the function of the lungs?'",
      "hard": "Delve into detailed biological processes, specific adaptations of organisms, complex ecosystem dynamics, or the history of significant biological discoveries. Example: 'Explain the process of cellular respiration.' or 'What is the difference between a marsupial and a placental mammal?'"
    },
    "isPredefined": true
  },
  {
    "topicValue": "HumanitiesSocialSciencesGeneral",
    "name": {
      "en": "Humanities & Social Sciences",
      "es": "Humanidades y Ciencias Sociales"
    },
    "icon": "Users2",
    "detailedPromptInstructions": "Generate diverse trivia questions covering a broad range of Humanities and Social Sciences. This includes: Philosophy (major thinkers, concepts, ethics, logic), Psychology (theories, famous psychologists, human behavior), Sociology (social structures, culture, social issues), Political Science (government types, ideologies, international relations), Economics (basic principles, micro/macro concepts, economic history), Linguistics (language structure, history, families), Anthropology (human cultures, evolution, archaeology), and significant works or figures within these fields. Questions should encourage critical thinking and awareness of human society and thought.",
    "difficultySpecificGuidelines": {
      "easy": "Focus on very well-known figures (e.g., 'Who was Plato?'), basic concepts (e.g., 'What is a democracy?'), or common human experiences related to these fields (e.g., 'What is an emotion?').",
      "medium": "Cover core theories, important historical developments in these fields, or specific terms. Example: 'What is the difference between microeconomics and macroeconomics?' or 'Who wrote \"The Interpretation of Dreams\"?'",
      "hard": "Delve into complex theoretical debates, influential but less mainstream thinkers, or detailed aspects of research methodologies within these disciplines. Example: 'Explain Max Weber's concept of 'verstehen'.' or 'What are the main arguments of John Rawls' theory of justice?'"
    },
    "isPredefined": true
  }  
]
