
[
  {
    "topicValue": "WorldLandmarks",
    "name": {
      "en": "World Landmarks",
      "es": "Monumentos del Mundo"
    },
    "icon": "Landmark",
    "isVisual": true,
    "detailedPromptInstructions": "Generate visual trivia questions where the user must identify a famous world landmark or its location from an image. For each item: 1. The 'question' text should ask something like 'What famous landmark is this?' or 'In which city is this landmark located?'. 2. The 'correctAnswer' must be the name of the landmark (e.g., 'Eiffel Tower') or its city/country (e.g., 'Paris'). 3. The 'distractors' must be three other plausible but incorrect landmark names or locations. 4. The 'explanation' should provide a brief, interesting fact about the landmark. 5. CRUCIAL: The 'imagePrompt' MUST be a detailed, photorealistic description of the landmark itself, including its name, to ensure accurate image generation. For example: 'A photorealistic, wide-angle shot of the Colosseum in Rome, Italy, during a sunny day.' The 'imageUrl' field should be left empty."
  },
  {
    "topicValue": "FlagsOfTheWorldVisual",
    "name": {
      "en": "Flags of the World",
      "es": "Banderas del Mundo"
    },
    "icon": "Flag",
    "isVisual": true,
    "detailedPromptInstructions": "Generate visual trivia questions where the user must identify the country corresponding to a flag. For each item: 1. The 'question' text should always be 'To which country does this flag belong?' or similar. 2. The 'correctAnswer' must be the name of the country. 3. The 'distractors' must be three other country names, preferably from the same continent. 4. The 'explanation' should give a brief detail about the flag's symbolism or the country itself. 5. CRUCIAL: The 'imagePrompt' MUST be a clear description of the flag. For example: 'A high-quality, photorealistic image of the national flag of Japan, waving gently in the wind against a clear blue sky.' The 'imageUrl' field should be left empty."
  },
  {
    "topicValue": "FamousPaintings",
    "name": {
      "en": "Famous Paintings",
      "es": "Pinturas Famosas"
    },
    "icon": "Palette",
    "isVisual": true,
    "detailedPromptInstructions": "Generate visual trivia questions about famous paintings. For each item: 1. The 'question' can ask for the artist's name ('Who painted this masterpiece?') or the artwork's title ('What is the name of this painting?'). The AI can choose which format is more appropriate. 2. The 'correctAnswer' is the artist's name or the painting's title. 3. The 'distractors' are other plausible artists or titles from a similar era or movement. 4. The 'explanation' should give a brief fact about the artwork or artist. 5. CRUCIAL: The 'imagePrompt' MUST be a clear description including the artwork's name and artist. For example: 'A high-quality, clear image of the painting \"The Starry Night\" by Vincent van Gogh.' The 'imageUrl' field should be left empty."
  }
]
